# ResetExternallyTaggedGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..ResetExternallyTaggedGeometry Method
DirectShapeType Class See Also
---
Removes all of the externally tagged geometry in this DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void ResetExternallyTaggedGeometry()
```

Visual Basic
---
```text
Public Sub ResetExternallyTaggedGeometry
```

Visual C++
---
```text
public:
void ResetExternallyTaggedGeometry()
```

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace